experiments/workflow/beldi-hotel/expected_results/qps300/wrk_warmup.log
Running 30s test @ http://ip-172-31-12-27.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 3.654ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 4.592ms, rate sampling interval: 44ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.97ms    9.14ms  41.92ms   89.41%
    Req/Sec   154.68     74.83   529.00     84.74%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.87ms
 75.000%    1.16ms
 90.000%   15.76ms
 99.000%   41.85ms
 99.900%   41.92ms
 99.990%   41.95ms
 99.999%   41.95ms
100.000%   41.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.235     0.000000            1         1.00
       0.394     0.100000          600         1.11
       0.517     0.200000         1202         1.25
       0.634     0.300000         1806         1.43
       0.740     0.400000         2404         1.67
       0.870     0.500000         3000         2.00
       0.927     0.550000         3305         2.22
       0.986     0.600000         3600         2.50
       1.042     0.650000         3903         2.86
       1.101     0.700000         4201         3.33
       1.160     0.750000         4499         4.00
       1.192     0.775000         4649         4.44
       1.225     0.800000         4799         5.00
       1.258     0.825000         4951         5.71
       1.326     0.850000         5099         6.67
       9.087     0.875000         5252         8.00
       9.311     0.887500         5325         8.89
      15.759     0.900000         5399        10.00
      15.975     0.912500         5475        11.43
      22.319     0.925000         5559        13.33
      28.623     0.937500         5626        16.00
      28.783     0.943750         5661        17.78
      28.847     0.950000         5701        20.00
      29.007     0.956250         5737        22.86
      35.231     0.962500         5780        26.67
      35.359     0.968750         5830        32.00
      35.359     0.971875         5830        35.56
      35.423     0.975000         5850        40.00
      35.519     0.978125         5870        45.71
      41.631     0.981250         5891        53.33
      41.695     0.984375         5919        64.00
      41.695     0.985938         5919        71.11
      41.855     0.987500         5973        80.00
      41.855     0.989062         5973        91.43
      41.855     0.990625         5973       106.67
      41.855     0.992188         5973       128.00
      41.855     0.992969         5973       142.22
      41.855     0.993750         5973       160.00
      41.855     0.994531         5973       182.86
      41.855     0.995313         5973       213.33
      41.887     0.996094         5980       256.00
      41.887     0.996484         5980       284.44
      41.887     0.996875         5980       320.00
      41.919     0.997266         5993       365.71
      41.919     0.997656         5993       426.67
      41.919     0.998047         5993       512.00
      41.919     0.998242         5993       568.89
      41.919     0.998437         5993       640.00
      41.919     0.998633         5993       731.43
      41.919     0.998828         5993       853.33
      41.919     0.999023         5993      1024.00
      41.919     0.999121         5993      1137.78
      41.951     0.999219         5998      1280.00
      41.951     1.000000         5998          inf
#[Mean    =        3.969, StdDeviation   =        9.143]
#[Max     =       41.920, Total count    =         5998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  185.00us
 75.000%  210.00us
 90.000%  231.00us
 99.000%   40.90ms
 99.900%   40.99ms
 99.990%   41.02ms
 99.999%   41.76ms
100.000%   41.76ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.130     0.000000            3         1.00
       0.155     0.100000          609         1.11
       0.164     0.200000         1250         1.25
       0.171     0.300000         1866         1.43
       0.178     0.400000         2465         1.67
       0.185     0.500000         3029         2.00
       0.190     0.550000         3350         2.22
       0.195     0.600000         3646         2.50
       0.200     0.650000         3937         2.86
       0.205     0.700000         4237         3.33
       0.210     0.750000         4510         4.00
       0.213     0.775000         4681         4.44
       0.216     0.800000         4831         5.00
       0.219     0.825000         4960         5.71
       0.223     0.850000         5120         6.67
       0.227     0.875000         5278         8.00
       0.229     0.887500         5350         8.89
       0.231     0.900000         5425        10.00
       0.234     0.912500         5493        11.43
       0.237     0.925000         5564        13.33
       0.240     0.937500         5628        16.00
       0.243     0.943750         5675        17.78
       0.245     0.950000         5706        20.00
       0.248     0.956250         5749        22.86
       0.251     0.962500         5777        26.67
       0.256     0.968750         5814        32.00
       0.260     0.971875         5831        35.56
       0.265     0.975000         5849        40.00
       0.285     0.978125         5867        45.71
      40.831     0.981250         5894        53.33
      40.863     0.984375         5916        64.00
      40.863     0.985938         5916        71.11
      40.895     0.987500         5943        80.00
      40.895     0.989062         5943        91.43
      40.895     0.990625         5943       106.67
      40.927     0.992188         5964       128.00
      40.927     0.992969         5964       142.22
      40.927     0.993750         5964       160.00
      40.959     0.994531         5986       182.86
      40.959     0.995313         5986       213.33
      40.959     0.996094         5986       256.00
      40.959     0.996484         5986       284.44
      40.959     0.996875         5986       320.00
      40.959     0.997266         5986       365.71
      40.959     0.997656         5986       426.67
      40.991     0.998047         5996       512.00
      40.991     0.998242         5996       568.89
      40.991     0.998437         5996       640.00
      40.991     0.998633         5996       731.43
      40.991     0.998828         5996       853.33
      40.991     0.999023         5996      1024.00
      40.991     0.999121         5996      1137.78
      40.991     0.999219         5996      1280.00
      40.991     0.999316         5996      1462.86
      40.991     0.999414         5996      1706.67
      40.991     0.999512         5996      2048.00
      40.991     0.999561         5996      2275.56
      40.991     0.999609         5996      2560.00
      40.991     0.999658         5996      2925.71
      41.023     0.999707         5997      3413.33
      41.023     0.999756         5997      4096.00
      41.023     0.999780         5997      4551.11
      41.023     0.999805         5997      5120.00
      41.023     0.999829         5997      5851.43
      41.759     0.999854         5998      6826.67
      41.759     1.000000         5998          inf
#[Mean    =        1.050, StdDeviation   =        5.860]
#[Max     =       41.728, Total count    =         5998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9002 requests in 30.00s, 1.40MB read
Requests/sec:    300.05
Transfer/sec:     47.76KB